{
  "version": "1.0",
  "curated": [
    {"name": "cloudflare-deploy", "description": "Deploy applications and infrastructure to Cloudflare using Workers, Pages, and related platform services. Use when the user asks to deploy, host, publish, or set up a project on Cloudflare.", "path": ".curated/cloudflare-deploy/SKILL.md"}
    ,{"name": "develop-web-game", "description": "\"Use when Codex is building or iterating on a web game (HTML/JS) and needs a reliable development + testing loop: implement small changes, run a Playwright-based test script with short input bursts and intentional pauses, inspect screenshots/text, and review console errors with render_game_to_text.\"", "path": ".curated/develop-web-game/SKILL.md"}
    ,{"name": "doc", "description": "\"Use when the task involves reading, creating, or editing `.docx` documents, especially when formatting or layout fidelity matters; prefer `python-docx` plus the bundled `scripts/render_docx.py` for visual checks.\"", "path": ".curated/doc/SKILL.md"}
    ,{"name": "figma-implement-design", "description": "\"Translate Figma nodes into production-ready code with 1:1 visual fidelity using the Figma MCP workflow (design context, screenshots, assets, and project-convention translation). Trigger when the user provides Figma URLs or node IDs, or asks to implement designs or components that must match Figma specs. Requires a working Figma MCP server connection.\"", "path": ".curated/figma-implement-design/SKILL.md"}
    ,{"name": "figma", "description": "Use the Figma MCP server to fetch design context, screenshots, variables, and assets from Figma, and to translate Figma nodes into production code. Trigger when a task involves Figma URLs, node IDs, design-to-code implementation, or Figma MCP setup and troubleshooting.", "path": ".curated/figma/SKILL.md"}
    ,{"name": "gh-address-comments", "description": "Help address review/issue comments on the open GitHub PR for the current branch using gh CLI; verify gh auth first and prompt the user to authenticate if not logged in.", "path": ".curated/gh-address-comments/SKILL.md"}
    ,{"name": "gh-fix-ci", "description": "\"Use when a user asks to debug or fix failing GitHub PR checks that run in GitHub Actions; use `gh` to inspect checks and logs, summarize failure context, draft a fix plan, and implement only after explicit approval. Treat external providers (for example Buildkite) as out of scope and report only the details URL.\"", "path": ".curated/gh-fix-ci/SKILL.md"}
    ,{"name": "imagegen", "description": "\"Use when the user asks to generate or edit images via the OpenAI Image API (for example: generate image, edit/inpaint/mask, background removal or replacement, transparent background, product shots, concept art, covers, or batch variants); run the bundled CLI (`scripts/image_gen.py`) and require `OPENAI_API_KEY` for live calls.\"", "path": ".curated/imagegen/SKILL.md"}
    ,{"name": "jupyter-notebook", "description": "\"Use when the user asks to create, scaffold, or edit Jupyter notebooks (`.ipynb`) for experiments, explorations, or tutorials; prefer the bundled templates and run the helper script `new_notebook.py` to generate a clean starting notebook.\"", "path": ".curated/jupyter-notebook/SKILL.md"}
    ,{"name": "linear", "description": "Manage issues, projects & team workflows in Linear. Use when the user wants to read, create or updates tickets in Linear.", "path": ".curated/linear/SKILL.md"}
    ,{"name": "netlify-deploy", "description": "Deploy web projects to Netlify using the Netlify CLI (`npx netlify`). Use when the user asks to deploy, host, publish, or link a site/repo on Netlify, including preview and production deploys.", "path": ".curated/netlify-deploy/SKILL.md"}
    ,{"name": "notion-knowledge-capture", "description": "Capture conversations and decisions into structured Notion pages; use when turning chats/notes into wiki entries, how-tos, decisions, or FAQs with proper linking.", "path": ".curated/notion-knowledge-capture/SKILL.md"}
    ,{"name": "notion-meeting-intelligence", "description": "Prepare meeting materials with Notion context and Codex research; use when gathering context, drafting agendas/pre-reads, and tailoring materials to attendees.", "path": ".curated/notion-meeting-intelligence/SKILL.md"}
    ,{"name": "notion-research-documentation", "description": "Research across Notion and synthesize into structured documentation; use when gathering info from multiple Notion sources to produce briefs, comparisons, or reports with citations.", "path": ".curated/notion-research-documentation/SKILL.md"}
    ,{"name": "notion-spec-to-implementation", "description": "Turn Notion specs into implementation plans, tasks, and progress tracking; use when implementing PRDs/feature specs and creating Notion plans + tasks from them.", "path": ".curated/notion-spec-to-implementation/SKILL.md"}
    ,{"name": "openai-docs", "description": "\"Use when the user asks how to build with OpenAI products or APIs and needs up-to-date official documentation with citations (for example: Codex, Responses API, Chat Completions, Apps SDK, Agents SDK, Realtime, model capabilities or limits); prioritize OpenAI docs MCP tools and restrict any fallback browsing to official OpenAI domains.\"", "path": ".curated/openai-docs/SKILL.md"}
    ,{"name": "pdf", "description": "\"Use when tasks involve reading, creating, or reviewing PDF files where rendering and layout matter; prefer visual checks by rendering pages (Poppler) and use Python tools such as `reportlab`, `pdfplumber`, and `pypdf` for generation and extraction.\"", "path": ".curated/pdf/SKILL.md"}
    ,{"name": "playwright", "description": "\"Use when the task requires automating a real browser from the terminal (navigation, form filling, snapshots, screenshots, data extraction, UI-flow debugging) via `playwright-cli` or the bundled wrapper script.\"", "path": ".curated/playwright/SKILL.md"}
    ,{"name": "render-deploy", "description": "Deploy applications to Render by analyzing codebases, generating render.yaml Blueprints, and providing Dashboard deeplinks. Use when the user wants to deploy, host, publish, or set up their application on Render's cloud platform.", "path": ".curated/render-deploy/SKILL.md"}
    ,{"name": "screenshot", "description": "\"Use when the user explicitly asks for a desktop or system screenshot (full screen, specific app or window, or a pixel region), or when tool-specific capture capabilities are unavailable and an OS-level capture is needed.\"", "path": ".curated/screenshot/SKILL.md"}
    ,{"name": "security-best-practices", "description": "\"Perform language and framework specific security best-practice reviews and suggest improvements. Trigger only when the user explicitly requests security best practices guidance, a security review/report, or secure-by-default coding help. Trigger only for supported languages (python, javascript/typescript, go). Do not trigger for general code review, debugging, or non-security tasks.\"", "path": ".curated/security-best-practices/SKILL.md"}
    ,{"name": "security-ownership-map", "description": "\"Analyze git repositories to build a security ownership topology (people-to-file), compute bus factor and sensitive-code ownership, and export CSV/JSON for graph databases and visualization. Trigger only when the user explicitly wants a security-oriented ownership or bus-factor analysis grounded in git history (for example: orphaned sensitive code, security maintainers, CODEOWNERS reality checks for risk, sensitive hotspots, or ownership clusters). Do not trigger for general maintainer lists or non-security ownership questions.\"", "path": ".curated/security-ownership-map/SKILL.md"}
    ,{"name": "security-threat-model", "description": "\"Repository-grounded threat modeling that enumerates trust boundaries, assets, attacker capabilities, abuse paths, and mitigations, and writes a concise Markdown threat model. Trigger only when the user explicitly asks to threat model a codebase or path, enumerate threats/abuse paths, or perform AppSec threat modeling. Do not trigger for general architecture summaries, code review, or non-security design work.\"", "path": ".curated/security-threat-model/SKILL.md"}
    ,{"name": "sentry", "description": "\"Use when the user asks to inspect Sentry issues or events, summarize recent production errors, or pull basic Sentry health data via the Sentry API; perform read-only queries with the bundled script and require `SENTRY_AUTH_TOKEN`.\"", "path": ".curated/sentry/SKILL.md"}
    ,{"name": "sora", "description": "\"Use when the user asks to generate, remix, poll, list, download, or delete Sora videos via OpenAI’s video API using the bundled CLI (`scripts/sora.py`), including requests like “generate AI video,” “Sora,” “video remix,” “download video/thumbnail/spritesheet,” and batch video generation; requires `OPENAI_API_KEY` and Sora API access.\"", "path": ".curated/sora/SKILL.md"}
    ,{"name": "speech", "description": "\"Use when the user asks for text-to-speech narration or voiceover, accessibility reads, audio prompts, or batch speech generation via the OpenAI Audio API; run the bundled CLI (`scripts/text_to_speech.py`) with built-in voices and require `OPENAI_API_KEY` for live calls. Custom voice creation is out of scope.\"", "path": ".curated/speech/SKILL.md"}
    ,{"name": "spreadsheet", "description": "\"Use when tasks involve creating, editing, analyzing, or formatting spreadsheets (`.xlsx`, `.csv`, `.tsv`) using Python (`openpyxl`, `pandas`), especially when formulas, references, and formatting need to be preserved and verified.\"", "path": ".curated/spreadsheet/SKILL.md"}
    ,{"name": "transcribe", "description": "\"Transcribe audio files to text with optional diarization and known-speaker hints. Use when a user asks to transcribe speech from audio/video, extract text from recordings, or label speakers in interviews or meetings.\"", "path": ".curated/transcribe/SKILL.md"}
    ,{"name": "vercel-deploy", "description": "Deploy applications and websites to Vercel. Use when the user requests deployment actions like \"deploy my app\", \"deploy and give me the link\", \"push this live\", or \"create a preview deployment\".", "path": ".curated/vercel-deploy/SKILL.md"}
    ,{"name": "yeet", "description": "\"Use only when the user explicitly asks to stage, commit, push, and open a GitHub pull request in one flow using the GitHub CLI (`gh`).\"", "path": ".curated/yeet/SKILL.md"}
  ],
  "system": [
    {"name": "skill-creator", "description": "Guide for creating effective skills. This skill should be used when users want to create a new skill (or update an existing skill) that extends Codex's capabilities with specialized knowledge, workflows, or tool integrations.", "path": ".system/skill-creator/SKILL.md"}
    ,{"name": "skill-installer", "description": "Install Codex skills into $CODEX_HOME/skills from a curated list or a GitHub repo path. Use when a user asks to list installable skills, install a curated skill, or install a skill from another repo (including private repos).", "path": ".system/skill-installer/SKILL.md"}
  ]
}
